netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_deleteList_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite">
  <soapenv:Header/>
   <soapenv:Body>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:method>deleteList</urn:method>
      <urn:warningAsError/>
      <urn:disableMandatoryCustomFieldValidation/>
      <urn:disableSystemNotesForCustomFields/>
      <urn:ignoreReadOnlyFields/>
      <urn:partnerId/>
      <urn:applicationId/>
      <urn:email>%s(email)</urn:email>
      <urn:password>%s(password)</urn:password>
      <urn:account>%s(account)</urn:account>
      <urn:roleInternalId/>
      <urn:roleExternalId/>
      <urn:roleType/>
      <urn:roleName/>
     <urn:recordRef>
     <RecordRef internalId="%s(addListMandatoryInternalId)" type="customer" xsi:type="platformCore:RecordRef" xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
    
    </urn:recordRef>
   </soapenv:Body>
</soapenv:Envelope>